# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.18-s082_1 on Fri May 09 16:11:41 EDT 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design my_project

create_clock -name "clk" -period 5000.0 -waveform {0.0 2500.0} [get_ports clk]
set_load -pin_load 50.0 [get_ports {C[3][3][15]}]
set_load -pin_load 50.0 [get_ports {C[3][3][14]}]
set_load -pin_load 50.0 [get_ports {C[3][3][13]}]
set_load -pin_load 50.0 [get_ports {C[3][3][12]}]
set_load -pin_load 50.0 [get_ports {C[3][3][11]}]
set_load -pin_load 50.0 [get_ports {C[3][3][10]}]
set_load -pin_load 50.0 [get_ports {C[3][3][9]}]
set_load -pin_load 50.0 [get_ports {C[3][3][8]}]
set_load -pin_load 50.0 [get_ports {C[3][3][7]}]
set_load -pin_load 50.0 [get_ports {C[3][3][6]}]
set_load -pin_load 50.0 [get_ports {C[3][3][5]}]
set_load -pin_load 50.0 [get_ports {C[3][3][4]}]
set_load -pin_load 50.0 [get_ports {C[3][3][3]}]
set_load -pin_load 50.0 [get_ports {C[3][3][2]}]
set_load -pin_load 50.0 [get_ports {C[3][3][1]}]
set_load -pin_load 50.0 [get_ports {C[3][3][0]}]
set_load -pin_load 50.0 [get_ports {C[3][2][15]}]
set_load -pin_load 50.0 [get_ports {C[3][2][14]}]
set_load -pin_load 50.0 [get_ports {C[3][2][13]}]
set_load -pin_load 50.0 [get_ports {C[3][2][12]}]
set_load -pin_load 50.0 [get_ports {C[3][2][11]}]
set_load -pin_load 50.0 [get_ports {C[3][2][10]}]
set_load -pin_load 50.0 [get_ports {C[3][2][9]}]
set_load -pin_load 50.0 [get_ports {C[3][2][8]}]
set_load -pin_load 50.0 [get_ports {C[3][2][7]}]
set_load -pin_load 50.0 [get_ports {C[3][2][6]}]
set_load -pin_load 50.0 [get_ports {C[3][2][5]}]
set_load -pin_load 50.0 [get_ports {C[3][2][4]}]
set_load -pin_load 50.0 [get_ports {C[3][2][3]}]
set_load -pin_load 50.0 [get_ports {C[3][2][2]}]
set_load -pin_load 50.0 [get_ports {C[3][2][1]}]
set_load -pin_load 50.0 [get_ports {C[3][2][0]}]
set_load -pin_load 50.0 [get_ports {C[3][1][15]}]
set_load -pin_load 50.0 [get_ports {C[3][1][14]}]
set_load -pin_load 50.0 [get_ports {C[3][1][13]}]
set_load -pin_load 50.0 [get_ports {C[3][1][12]}]
set_load -pin_load 50.0 [get_ports {C[3][1][11]}]
set_load -pin_load 50.0 [get_ports {C[3][1][10]}]
set_load -pin_load 50.0 [get_ports {C[3][1][9]}]
set_load -pin_load 50.0 [get_ports {C[3][1][8]}]
set_load -pin_load 50.0 [get_ports {C[3][1][7]}]
set_load -pin_load 50.0 [get_ports {C[3][1][6]}]
set_load -pin_load 50.0 [get_ports {C[3][1][5]}]
set_load -pin_load 50.0 [get_ports {C[3][1][4]}]
set_load -pin_load 50.0 [get_ports {C[3][1][3]}]
set_load -pin_load 50.0 [get_ports {C[3][1][2]}]
set_load -pin_load 50.0 [get_ports {C[3][1][1]}]
set_load -pin_load 50.0 [get_ports {C[3][1][0]}]
set_load -pin_load 50.0 [get_ports {C[3][0][15]}]
set_load -pin_load 50.0 [get_ports {C[3][0][14]}]
set_load -pin_load 50.0 [get_ports {C[3][0][13]}]
set_load -pin_load 50.0 [get_ports {C[3][0][12]}]
set_load -pin_load 50.0 [get_ports {C[3][0][11]}]
set_load -pin_load 50.0 [get_ports {C[3][0][10]}]
set_load -pin_load 50.0 [get_ports {C[3][0][9]}]
set_load -pin_load 50.0 [get_ports {C[3][0][8]}]
set_load -pin_load 50.0 [get_ports {C[3][0][7]}]
set_load -pin_load 50.0 [get_ports {C[3][0][6]}]
set_load -pin_load 50.0 [get_ports {C[3][0][5]}]
set_load -pin_load 50.0 [get_ports {C[3][0][4]}]
set_load -pin_load 50.0 [get_ports {C[3][0][3]}]
set_load -pin_load 50.0 [get_ports {C[3][0][2]}]
set_load -pin_load 50.0 [get_ports {C[3][0][1]}]
set_load -pin_load 50.0 [get_ports {C[3][0][0]}]
set_load -pin_load 50.0 [get_ports {C[2][3][15]}]
set_load -pin_load 50.0 [get_ports {C[2][3][14]}]
set_load -pin_load 50.0 [get_ports {C[2][3][13]}]
set_load -pin_load 50.0 [get_ports {C[2][3][12]}]
set_load -pin_load 50.0 [get_ports {C[2][3][11]}]
set_load -pin_load 50.0 [get_ports {C[2][3][10]}]
set_load -pin_load 50.0 [get_ports {C[2][3][9]}]
set_load -pin_load 50.0 [get_ports {C[2][3][8]}]
set_load -pin_load 50.0 [get_ports {C[2][3][7]}]
set_load -pin_load 50.0 [get_ports {C[2][3][6]}]
set_load -pin_load 50.0 [get_ports {C[2][3][5]}]
set_load -pin_load 50.0 [get_ports {C[2][3][4]}]
set_load -pin_load 50.0 [get_ports {C[2][3][3]}]
set_load -pin_load 50.0 [get_ports {C[2][3][2]}]
set_load -pin_load 50.0 [get_ports {C[2][3][1]}]
set_load -pin_load 50.0 [get_ports {C[2][3][0]}]
set_load -pin_load 50.0 [get_ports {C[2][2][15]}]
set_load -pin_load 50.0 [get_ports {C[2][2][14]}]
set_load -pin_load 50.0 [get_ports {C[2][2][13]}]
set_load -pin_load 50.0 [get_ports {C[2][2][12]}]
set_load -pin_load 50.0 [get_ports {C[2][2][11]}]
set_load -pin_load 50.0 [get_ports {C[2][2][10]}]
set_load -pin_load 50.0 [get_ports {C[2][2][9]}]
set_load -pin_load 50.0 [get_ports {C[2][2][8]}]
set_load -pin_load 50.0 [get_ports {C[2][2][7]}]
set_load -pin_load 50.0 [get_ports {C[2][2][6]}]
set_load -pin_load 50.0 [get_ports {C[2][2][5]}]
set_load -pin_load 50.0 [get_ports {C[2][2][4]}]
set_load -pin_load 50.0 [get_ports {C[2][2][3]}]
set_load -pin_load 50.0 [get_ports {C[2][2][2]}]
set_load -pin_load 50.0 [get_ports {C[2][2][1]}]
set_load -pin_load 50.0 [get_ports {C[2][2][0]}]
set_load -pin_load 50.0 [get_ports {C[2][1][15]}]
set_load -pin_load 50.0 [get_ports {C[2][1][14]}]
set_load -pin_load 50.0 [get_ports {C[2][1][13]}]
set_load -pin_load 50.0 [get_ports {C[2][1][12]}]
set_load -pin_load 50.0 [get_ports {C[2][1][11]}]
set_load -pin_load 50.0 [get_ports {C[2][1][10]}]
set_load -pin_load 50.0 [get_ports {C[2][1][9]}]
set_load -pin_load 50.0 [get_ports {C[2][1][8]}]
set_load -pin_load 50.0 [get_ports {C[2][1][7]}]
set_load -pin_load 50.0 [get_ports {C[2][1][6]}]
set_load -pin_load 50.0 [get_ports {C[2][1][5]}]
set_load -pin_load 50.0 [get_ports {C[2][1][4]}]
set_load -pin_load 50.0 [get_ports {C[2][1][3]}]
set_load -pin_load 50.0 [get_ports {C[2][1][2]}]
set_load -pin_load 50.0 [get_ports {C[2][1][1]}]
set_load -pin_load 50.0 [get_ports {C[2][1][0]}]
set_load -pin_load 50.0 [get_ports {C[2][0][15]}]
set_load -pin_load 50.0 [get_ports {C[2][0][14]}]
set_load -pin_load 50.0 [get_ports {C[2][0][13]}]
set_load -pin_load 50.0 [get_ports {C[2][0][12]}]
set_load -pin_load 50.0 [get_ports {C[2][0][11]}]
set_load -pin_load 50.0 [get_ports {C[2][0][10]}]
set_load -pin_load 50.0 [get_ports {C[2][0][9]}]
set_load -pin_load 50.0 [get_ports {C[2][0][8]}]
set_load -pin_load 50.0 [get_ports {C[2][0][7]}]
set_load -pin_load 50.0 [get_ports {C[2][0][6]}]
set_load -pin_load 50.0 [get_ports {C[2][0][5]}]
set_load -pin_load 50.0 [get_ports {C[2][0][4]}]
set_load -pin_load 50.0 [get_ports {C[2][0][3]}]
set_load -pin_load 50.0 [get_ports {C[2][0][2]}]
set_load -pin_load 50.0 [get_ports {C[2][0][1]}]
set_load -pin_load 50.0 [get_ports {C[2][0][0]}]
set_load -pin_load 50.0 [get_ports {C[1][3][15]}]
set_load -pin_load 50.0 [get_ports {C[1][3][14]}]
set_load -pin_load 50.0 [get_ports {C[1][3][13]}]
set_load -pin_load 50.0 [get_ports {C[1][3][12]}]
set_load -pin_load 50.0 [get_ports {C[1][3][11]}]
set_load -pin_load 50.0 [get_ports {C[1][3][10]}]
set_load -pin_load 50.0 [get_ports {C[1][3][9]}]
set_load -pin_load 50.0 [get_ports {C[1][3][8]}]
set_load -pin_load 50.0 [get_ports {C[1][3][7]}]
set_load -pin_load 50.0 [get_ports {C[1][3][6]}]
set_load -pin_load 50.0 [get_ports {C[1][3][5]}]
set_load -pin_load 50.0 [get_ports {C[1][3][4]}]
set_load -pin_load 50.0 [get_ports {C[1][3][3]}]
set_load -pin_load 50.0 [get_ports {C[1][3][2]}]
set_load -pin_load 50.0 [get_ports {C[1][3][1]}]
set_load -pin_load 50.0 [get_ports {C[1][3][0]}]
set_load -pin_load 50.0 [get_ports {C[1][2][15]}]
set_load -pin_load 50.0 [get_ports {C[1][2][14]}]
set_load -pin_load 50.0 [get_ports {C[1][2][13]}]
set_load -pin_load 50.0 [get_ports {C[1][2][12]}]
set_load -pin_load 50.0 [get_ports {C[1][2][11]}]
set_load -pin_load 50.0 [get_ports {C[1][2][10]}]
set_load -pin_load 50.0 [get_ports {C[1][2][9]}]
set_load -pin_load 50.0 [get_ports {C[1][2][8]}]
set_load -pin_load 50.0 [get_ports {C[1][2][7]}]
set_load -pin_load 50.0 [get_ports {C[1][2][6]}]
set_load -pin_load 50.0 [get_ports {C[1][2][5]}]
set_load -pin_load 50.0 [get_ports {C[1][2][4]}]
set_load -pin_load 50.0 [get_ports {C[1][2][3]}]
set_load -pin_load 50.0 [get_ports {C[1][2][2]}]
set_load -pin_load 50.0 [get_ports {C[1][2][1]}]
set_load -pin_load 50.0 [get_ports {C[1][2][0]}]
set_load -pin_load 50.0 [get_ports {C[1][1][15]}]
set_load -pin_load 50.0 [get_ports {C[1][1][14]}]
set_load -pin_load 50.0 [get_ports {C[1][1][13]}]
set_load -pin_load 50.0 [get_ports {C[1][1][12]}]
set_load -pin_load 50.0 [get_ports {C[1][1][11]}]
set_load -pin_load 50.0 [get_ports {C[1][1][10]}]
set_load -pin_load 50.0 [get_ports {C[1][1][9]}]
set_load -pin_load 50.0 [get_ports {C[1][1][8]}]
set_load -pin_load 50.0 [get_ports {C[1][1][7]}]
set_load -pin_load 50.0 [get_ports {C[1][1][6]}]
set_load -pin_load 50.0 [get_ports {C[1][1][5]}]
set_load -pin_load 50.0 [get_ports {C[1][1][4]}]
set_load -pin_load 50.0 [get_ports {C[1][1][3]}]
set_load -pin_load 50.0 [get_ports {C[1][1][2]}]
set_load -pin_load 50.0 [get_ports {C[1][1][1]}]
set_load -pin_load 50.0 [get_ports {C[1][1][0]}]
set_load -pin_load 50.0 [get_ports {C[1][0][15]}]
set_load -pin_load 50.0 [get_ports {C[1][0][14]}]
set_load -pin_load 50.0 [get_ports {C[1][0][13]}]
set_load -pin_load 50.0 [get_ports {C[1][0][12]}]
set_load -pin_load 50.0 [get_ports {C[1][0][11]}]
set_load -pin_load 50.0 [get_ports {C[1][0][10]}]
set_load -pin_load 50.0 [get_ports {C[1][0][9]}]
set_load -pin_load 50.0 [get_ports {C[1][0][8]}]
set_load -pin_load 50.0 [get_ports {C[1][0][7]}]
set_load -pin_load 50.0 [get_ports {C[1][0][6]}]
set_load -pin_load 50.0 [get_ports {C[1][0][5]}]
set_load -pin_load 50.0 [get_ports {C[1][0][4]}]
set_load -pin_load 50.0 [get_ports {C[1][0][3]}]
set_load -pin_load 50.0 [get_ports {C[1][0][2]}]
set_load -pin_load 50.0 [get_ports {C[1][0][1]}]
set_load -pin_load 50.0 [get_ports {C[1][0][0]}]
set_load -pin_load 50.0 [get_ports {C[0][3][15]}]
set_load -pin_load 50.0 [get_ports {C[0][3][14]}]
set_load -pin_load 50.0 [get_ports {C[0][3][13]}]
set_load -pin_load 50.0 [get_ports {C[0][3][12]}]
set_load -pin_load 50.0 [get_ports {C[0][3][11]}]
set_load -pin_load 50.0 [get_ports {C[0][3][10]}]
set_load -pin_load 50.0 [get_ports {C[0][3][9]}]
set_load -pin_load 50.0 [get_ports {C[0][3][8]}]
set_load -pin_load 50.0 [get_ports {C[0][3][7]}]
set_load -pin_load 50.0 [get_ports {C[0][3][6]}]
set_load -pin_load 50.0 [get_ports {C[0][3][5]}]
set_load -pin_load 50.0 [get_ports {C[0][3][4]}]
set_load -pin_load 50.0 [get_ports {C[0][3][3]}]
set_load -pin_load 50.0 [get_ports {C[0][3][2]}]
set_load -pin_load 50.0 [get_ports {C[0][3][1]}]
set_load -pin_load 50.0 [get_ports {C[0][3][0]}]
set_load -pin_load 50.0 [get_ports {C[0][2][15]}]
set_load -pin_load 50.0 [get_ports {C[0][2][14]}]
set_load -pin_load 50.0 [get_ports {C[0][2][13]}]
set_load -pin_load 50.0 [get_ports {C[0][2][12]}]
set_load -pin_load 50.0 [get_ports {C[0][2][11]}]
set_load -pin_load 50.0 [get_ports {C[0][2][10]}]
set_load -pin_load 50.0 [get_ports {C[0][2][9]}]
set_load -pin_load 50.0 [get_ports {C[0][2][8]}]
set_load -pin_load 50.0 [get_ports {C[0][2][7]}]
set_load -pin_load 50.0 [get_ports {C[0][2][6]}]
set_load -pin_load 50.0 [get_ports {C[0][2][5]}]
set_load -pin_load 50.0 [get_ports {C[0][2][4]}]
set_load -pin_load 50.0 [get_ports {C[0][2][3]}]
set_load -pin_load 50.0 [get_ports {C[0][2][2]}]
set_load -pin_load 50.0 [get_ports {C[0][2][1]}]
set_load -pin_load 50.0 [get_ports {C[0][2][0]}]
set_load -pin_load 50.0 [get_ports {C[0][1][15]}]
set_load -pin_load 50.0 [get_ports {C[0][1][14]}]
set_load -pin_load 50.0 [get_ports {C[0][1][13]}]
set_load -pin_load 50.0 [get_ports {C[0][1][12]}]
set_load -pin_load 50.0 [get_ports {C[0][1][11]}]
set_load -pin_load 50.0 [get_ports {C[0][1][10]}]
set_load -pin_load 50.0 [get_ports {C[0][1][9]}]
set_load -pin_load 50.0 [get_ports {C[0][1][8]}]
set_load -pin_load 50.0 [get_ports {C[0][1][7]}]
set_load -pin_load 50.0 [get_ports {C[0][1][6]}]
set_load -pin_load 50.0 [get_ports {C[0][1][5]}]
set_load -pin_load 50.0 [get_ports {C[0][1][4]}]
set_load -pin_load 50.0 [get_ports {C[0][1][3]}]
set_load -pin_load 50.0 [get_ports {C[0][1][2]}]
set_load -pin_load 50.0 [get_ports {C[0][1][1]}]
set_load -pin_load 50.0 [get_ports {C[0][1][0]}]
set_load -pin_load 50.0 [get_ports {C[0][0][15]}]
set_load -pin_load 50.0 [get_ports {C[0][0][14]}]
set_load -pin_load 50.0 [get_ports {C[0][0][13]}]
set_load -pin_load 50.0 [get_ports {C[0][0][12]}]
set_load -pin_load 50.0 [get_ports {C[0][0][11]}]
set_load -pin_load 50.0 [get_ports {C[0][0][10]}]
set_load -pin_load 50.0 [get_ports {C[0][0][9]}]
set_load -pin_load 50.0 [get_ports {C[0][0][8]}]
set_load -pin_load 50.0 [get_ports {C[0][0][7]}]
set_load -pin_load 50.0 [get_ports {C[0][0][6]}]
set_load -pin_load 50.0 [get_ports {C[0][0][5]}]
set_load -pin_load 50.0 [get_ports {C[0][0][4]}]
set_load -pin_load 50.0 [get_ports {C[0][0][3]}]
set_load -pin_load 50.0 [get_ports {C[0][0][2]}]
set_load -pin_load 50.0 [get_ports {C[0][0][1]}]
set_load -pin_load 50.0 [get_ports {C[0][0][0]}]
set_load -pin_load 50.0 [get_ports done]
set_clock_gating_check -setup 0.0 
set_input_delay -add_delay 1000.0 [get_ports reset]
set_input_delay -add_delay 1000.0 [get_ports start]
set_input_delay -add_delay 1000.0 [get_ports {A[3][3][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][3][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][3][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][3][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][3][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][3][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][3][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][3][0]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][2][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][2][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][2][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][2][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][2][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][2][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][2][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][2][0]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][1][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][1][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][1][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][1][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][1][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][1][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][1][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][1][0]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][0][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][0][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][0][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][0][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][0][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][0][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][0][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[3][0][0]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][3][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][3][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][3][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][3][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][3][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][3][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][3][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][3][0]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][2][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][2][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][2][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][2][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][2][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][2][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][2][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][2][0]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][1][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][1][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][1][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][1][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][1][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][1][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][1][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][1][0]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][0][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][0][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][0][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][0][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][0][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][0][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][0][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[2][0][0]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][3][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][3][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][3][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][3][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][3][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][3][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][3][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][3][0]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][2][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][2][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][2][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][2][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][2][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][2][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][2][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][2][0]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][1][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][1][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][1][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][1][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][1][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][1][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][1][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][1][0]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][0][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][0][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][0][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][0][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][0][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][0][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][0][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[1][0][0]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][3][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][3][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][3][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][3][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][3][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][3][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][3][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][3][0]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][2][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][2][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][2][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][2][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][2][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][2][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][2][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][2][0]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][1][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][1][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][1][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][1][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][1][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][1][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][1][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][1][0]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][0][7]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][0][6]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][0][5]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][0][4]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][0][3]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][0][2]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][0][1]}]
set_input_delay -add_delay 1000.0 [get_ports {A[0][0][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][3][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][3][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][3][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][3][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][3][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][3][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][3][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][3][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][2][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][2][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][2][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][2][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][2][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][2][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][2][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][2][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][1][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][1][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][1][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][1][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][1][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][1][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][1][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][1][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][0][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][0][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][0][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][0][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][0][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][0][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][0][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[3][0][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][3][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][3][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][3][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][3][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][3][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][3][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][3][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][3][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][2][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][2][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][2][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][2][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][2][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][2][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][2][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][2][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][1][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][1][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][1][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][1][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][1][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][1][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][1][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][1][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][0][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][0][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][0][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][0][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][0][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][0][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][0][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[2][0][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][3][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][3][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][3][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][3][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][3][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][3][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][3][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][3][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][2][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][2][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][2][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][2][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][2][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][2][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][2][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][2][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][1][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][1][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][1][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][1][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][1][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][1][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][1][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][1][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][0][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][0][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][0][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][0][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][0][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][0][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][0][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[1][0][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][3][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][3][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][3][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][3][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][3][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][3][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][3][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][3][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][2][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][2][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][2][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][2][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][2][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][2][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][2][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][2][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][1][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][1][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][1][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][1][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][1][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][1][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][1][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][1][0]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][0][7]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][0][6]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][0][5]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][0][4]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][0][3]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][0][2]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][0][1]}]
set_input_delay -add_delay 1000.0 [get_ports {B[0][0][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][3][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][2][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][1][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[3][0][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][3][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][2][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][1][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[2][0][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][3][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][2][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][1][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[1][0][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][3][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][2][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][1][0]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][15]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][14]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][13]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][12]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][11]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][10]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][9]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][8]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][7]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][6]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][5]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][4]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][3]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][2]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][1]}]
set_output_delay -add_delay 1000.0 [get_ports {C[0][0][0]}]
set_output_delay -add_delay 1000.0 [get_ports done]
set_max_transition 400.0 [get_ports clk]
set_max_transition 400.0 [get_ports reset]
set_max_transition 400.0 [get_ports start]
set_max_transition 400.0 [get_ports {A[3][3][7]}]
set_max_transition 400.0 [get_ports {A[3][3][6]}]
set_max_transition 400.0 [get_ports {A[3][3][5]}]
set_max_transition 400.0 [get_ports {A[3][3][4]}]
set_max_transition 400.0 [get_ports {A[3][3][3]}]
set_max_transition 400.0 [get_ports {A[3][3][2]}]
set_max_transition 400.0 [get_ports {A[3][3][1]}]
set_max_transition 400.0 [get_ports {A[3][3][0]}]
set_max_transition 400.0 [get_ports {A[3][2][7]}]
set_max_transition 400.0 [get_ports {A[3][2][6]}]
set_max_transition 400.0 [get_ports {A[3][2][5]}]
set_max_transition 400.0 [get_ports {A[3][2][4]}]
set_max_transition 400.0 [get_ports {A[3][2][3]}]
set_max_transition 400.0 [get_ports {A[3][2][2]}]
set_max_transition 400.0 [get_ports {A[3][2][1]}]
set_max_transition 400.0 [get_ports {A[3][2][0]}]
set_max_transition 400.0 [get_ports {A[3][1][7]}]
set_max_transition 400.0 [get_ports {A[3][1][6]}]
set_max_transition 400.0 [get_ports {A[3][1][5]}]
set_max_transition 400.0 [get_ports {A[3][1][4]}]
set_max_transition 400.0 [get_ports {A[3][1][3]}]
set_max_transition 400.0 [get_ports {A[3][1][2]}]
set_max_transition 400.0 [get_ports {A[3][1][1]}]
set_max_transition 400.0 [get_ports {A[3][1][0]}]
set_max_transition 400.0 [get_ports {A[3][0][7]}]
set_max_transition 400.0 [get_ports {A[3][0][6]}]
set_max_transition 400.0 [get_ports {A[3][0][5]}]
set_max_transition 400.0 [get_ports {A[3][0][4]}]
set_max_transition 400.0 [get_ports {A[3][0][3]}]
set_max_transition 400.0 [get_ports {A[3][0][2]}]
set_max_transition 400.0 [get_ports {A[3][0][1]}]
set_max_transition 400.0 [get_ports {A[3][0][0]}]
set_max_transition 400.0 [get_ports {A[2][3][7]}]
set_max_transition 400.0 [get_ports {A[2][3][6]}]
set_max_transition 400.0 [get_ports {A[2][3][5]}]
set_max_transition 400.0 [get_ports {A[2][3][4]}]
set_max_transition 400.0 [get_ports {A[2][3][3]}]
set_max_transition 400.0 [get_ports {A[2][3][2]}]
set_max_transition 400.0 [get_ports {A[2][3][1]}]
set_max_transition 400.0 [get_ports {A[2][3][0]}]
set_max_transition 400.0 [get_ports {A[2][2][7]}]
set_max_transition 400.0 [get_ports {A[2][2][6]}]
set_max_transition 400.0 [get_ports {A[2][2][5]}]
set_max_transition 400.0 [get_ports {A[2][2][4]}]
set_max_transition 400.0 [get_ports {A[2][2][3]}]
set_max_transition 400.0 [get_ports {A[2][2][2]}]
set_max_transition 400.0 [get_ports {A[2][2][1]}]
set_max_transition 400.0 [get_ports {A[2][2][0]}]
set_max_transition 400.0 [get_ports {A[2][1][7]}]
set_max_transition 400.0 [get_ports {A[2][1][6]}]
set_max_transition 400.0 [get_ports {A[2][1][5]}]
set_max_transition 400.0 [get_ports {A[2][1][4]}]
set_max_transition 400.0 [get_ports {A[2][1][3]}]
set_max_transition 400.0 [get_ports {A[2][1][2]}]
set_max_transition 400.0 [get_ports {A[2][1][1]}]
set_max_transition 400.0 [get_ports {A[2][1][0]}]
set_max_transition 400.0 [get_ports {A[2][0][7]}]
set_max_transition 400.0 [get_ports {A[2][0][6]}]
set_max_transition 400.0 [get_ports {A[2][0][5]}]
set_max_transition 400.0 [get_ports {A[2][0][4]}]
set_max_transition 400.0 [get_ports {A[2][0][3]}]
set_max_transition 400.0 [get_ports {A[2][0][2]}]
set_max_transition 400.0 [get_ports {A[2][0][1]}]
set_max_transition 400.0 [get_ports {A[2][0][0]}]
set_max_transition 400.0 [get_ports {A[1][3][7]}]
set_max_transition 400.0 [get_ports {A[1][3][6]}]
set_max_transition 400.0 [get_ports {A[1][3][5]}]
set_max_transition 400.0 [get_ports {A[1][3][4]}]
set_max_transition 400.0 [get_ports {A[1][3][3]}]
set_max_transition 400.0 [get_ports {A[1][3][2]}]
set_max_transition 400.0 [get_ports {A[1][3][1]}]
set_max_transition 400.0 [get_ports {A[1][3][0]}]
set_max_transition 400.0 [get_ports {A[1][2][7]}]
set_max_transition 400.0 [get_ports {A[1][2][6]}]
set_max_transition 400.0 [get_ports {A[1][2][5]}]
set_max_transition 400.0 [get_ports {A[1][2][4]}]
set_max_transition 400.0 [get_ports {A[1][2][3]}]
set_max_transition 400.0 [get_ports {A[1][2][2]}]
set_max_transition 400.0 [get_ports {A[1][2][1]}]
set_max_transition 400.0 [get_ports {A[1][2][0]}]
set_max_transition 400.0 [get_ports {A[1][1][7]}]
set_max_transition 400.0 [get_ports {A[1][1][6]}]
set_max_transition 400.0 [get_ports {A[1][1][5]}]
set_max_transition 400.0 [get_ports {A[1][1][4]}]
set_max_transition 400.0 [get_ports {A[1][1][3]}]
set_max_transition 400.0 [get_ports {A[1][1][2]}]
set_max_transition 400.0 [get_ports {A[1][1][1]}]
set_max_transition 400.0 [get_ports {A[1][1][0]}]
set_max_transition 400.0 [get_ports {A[1][0][7]}]
set_max_transition 400.0 [get_ports {A[1][0][6]}]
set_max_transition 400.0 [get_ports {A[1][0][5]}]
set_max_transition 400.0 [get_ports {A[1][0][4]}]
set_max_transition 400.0 [get_ports {A[1][0][3]}]
set_max_transition 400.0 [get_ports {A[1][0][2]}]
set_max_transition 400.0 [get_ports {A[1][0][1]}]
set_max_transition 400.0 [get_ports {A[1][0][0]}]
set_max_transition 400.0 [get_ports {A[0][3][7]}]
set_max_transition 400.0 [get_ports {A[0][3][6]}]
set_max_transition 400.0 [get_ports {A[0][3][5]}]
set_max_transition 400.0 [get_ports {A[0][3][4]}]
set_max_transition 400.0 [get_ports {A[0][3][3]}]
set_max_transition 400.0 [get_ports {A[0][3][2]}]
set_max_transition 400.0 [get_ports {A[0][3][1]}]
set_max_transition 400.0 [get_ports {A[0][3][0]}]
set_max_transition 400.0 [get_ports {A[0][2][7]}]
set_max_transition 400.0 [get_ports {A[0][2][6]}]
set_max_transition 400.0 [get_ports {A[0][2][5]}]
set_max_transition 400.0 [get_ports {A[0][2][4]}]
set_max_transition 400.0 [get_ports {A[0][2][3]}]
set_max_transition 400.0 [get_ports {A[0][2][2]}]
set_max_transition 400.0 [get_ports {A[0][2][1]}]
set_max_transition 400.0 [get_ports {A[0][2][0]}]
set_max_transition 400.0 [get_ports {A[0][1][7]}]
set_max_transition 400.0 [get_ports {A[0][1][6]}]
set_max_transition 400.0 [get_ports {A[0][1][5]}]
set_max_transition 400.0 [get_ports {A[0][1][4]}]
set_max_transition 400.0 [get_ports {A[0][1][3]}]
set_max_transition 400.0 [get_ports {A[0][1][2]}]
set_max_transition 400.0 [get_ports {A[0][1][1]}]
set_max_transition 400.0 [get_ports {A[0][1][0]}]
set_max_transition 400.0 [get_ports {A[0][0][7]}]
set_max_transition 400.0 [get_ports {A[0][0][6]}]
set_max_transition 400.0 [get_ports {A[0][0][5]}]
set_max_transition 400.0 [get_ports {A[0][0][4]}]
set_max_transition 400.0 [get_ports {A[0][0][3]}]
set_max_transition 400.0 [get_ports {A[0][0][2]}]
set_max_transition 400.0 [get_ports {A[0][0][1]}]
set_max_transition 400.0 [get_ports {A[0][0][0]}]
set_max_transition 400.0 [get_ports {B[3][3][7]}]
set_max_transition 400.0 [get_ports {B[3][3][6]}]
set_max_transition 400.0 [get_ports {B[3][3][5]}]
set_max_transition 400.0 [get_ports {B[3][3][4]}]
set_max_transition 400.0 [get_ports {B[3][3][3]}]
set_max_transition 400.0 [get_ports {B[3][3][2]}]
set_max_transition 400.0 [get_ports {B[3][3][1]}]
set_max_transition 400.0 [get_ports {B[3][3][0]}]
set_max_transition 400.0 [get_ports {B[3][2][7]}]
set_max_transition 400.0 [get_ports {B[3][2][6]}]
set_max_transition 400.0 [get_ports {B[3][2][5]}]
set_max_transition 400.0 [get_ports {B[3][2][4]}]
set_max_transition 400.0 [get_ports {B[3][2][3]}]
set_max_transition 400.0 [get_ports {B[3][2][2]}]
set_max_transition 400.0 [get_ports {B[3][2][1]}]
set_max_transition 400.0 [get_ports {B[3][2][0]}]
set_max_transition 400.0 [get_ports {B[3][1][7]}]
set_max_transition 400.0 [get_ports {B[3][1][6]}]
set_max_transition 400.0 [get_ports {B[3][1][5]}]
set_max_transition 400.0 [get_ports {B[3][1][4]}]
set_max_transition 400.0 [get_ports {B[3][1][3]}]
set_max_transition 400.0 [get_ports {B[3][1][2]}]
set_max_transition 400.0 [get_ports {B[3][1][1]}]
set_max_transition 400.0 [get_ports {B[3][1][0]}]
set_max_transition 400.0 [get_ports {B[3][0][7]}]
set_max_transition 400.0 [get_ports {B[3][0][6]}]
set_max_transition 400.0 [get_ports {B[3][0][5]}]
set_max_transition 400.0 [get_ports {B[3][0][4]}]
set_max_transition 400.0 [get_ports {B[3][0][3]}]
set_max_transition 400.0 [get_ports {B[3][0][2]}]
set_max_transition 400.0 [get_ports {B[3][0][1]}]
set_max_transition 400.0 [get_ports {B[3][0][0]}]
set_max_transition 400.0 [get_ports {B[2][3][7]}]
set_max_transition 400.0 [get_ports {B[2][3][6]}]
set_max_transition 400.0 [get_ports {B[2][3][5]}]
set_max_transition 400.0 [get_ports {B[2][3][4]}]
set_max_transition 400.0 [get_ports {B[2][3][3]}]
set_max_transition 400.0 [get_ports {B[2][3][2]}]
set_max_transition 400.0 [get_ports {B[2][3][1]}]
set_max_transition 400.0 [get_ports {B[2][3][0]}]
set_max_transition 400.0 [get_ports {B[2][2][7]}]
set_max_transition 400.0 [get_ports {B[2][2][6]}]
set_max_transition 400.0 [get_ports {B[2][2][5]}]
set_max_transition 400.0 [get_ports {B[2][2][4]}]
set_max_transition 400.0 [get_ports {B[2][2][3]}]
set_max_transition 400.0 [get_ports {B[2][2][2]}]
set_max_transition 400.0 [get_ports {B[2][2][1]}]
set_max_transition 400.0 [get_ports {B[2][2][0]}]
set_max_transition 400.0 [get_ports {B[2][1][7]}]
set_max_transition 400.0 [get_ports {B[2][1][6]}]
set_max_transition 400.0 [get_ports {B[2][1][5]}]
set_max_transition 400.0 [get_ports {B[2][1][4]}]
set_max_transition 400.0 [get_ports {B[2][1][3]}]
set_max_transition 400.0 [get_ports {B[2][1][2]}]
set_max_transition 400.0 [get_ports {B[2][1][1]}]
set_max_transition 400.0 [get_ports {B[2][1][0]}]
set_max_transition 400.0 [get_ports {B[2][0][7]}]
set_max_transition 400.0 [get_ports {B[2][0][6]}]
set_max_transition 400.0 [get_ports {B[2][0][5]}]
set_max_transition 400.0 [get_ports {B[2][0][4]}]
set_max_transition 400.0 [get_ports {B[2][0][3]}]
set_max_transition 400.0 [get_ports {B[2][0][2]}]
set_max_transition 400.0 [get_ports {B[2][0][1]}]
set_max_transition 400.0 [get_ports {B[2][0][0]}]
set_max_transition 400.0 [get_ports {B[1][3][7]}]
set_max_transition 400.0 [get_ports {B[1][3][6]}]
set_max_transition 400.0 [get_ports {B[1][3][5]}]
set_max_transition 400.0 [get_ports {B[1][3][4]}]
set_max_transition 400.0 [get_ports {B[1][3][3]}]
set_max_transition 400.0 [get_ports {B[1][3][2]}]
set_max_transition 400.0 [get_ports {B[1][3][1]}]
set_max_transition 400.0 [get_ports {B[1][3][0]}]
set_max_transition 400.0 [get_ports {B[1][2][7]}]
set_max_transition 400.0 [get_ports {B[1][2][6]}]
set_max_transition 400.0 [get_ports {B[1][2][5]}]
set_max_transition 400.0 [get_ports {B[1][2][4]}]
set_max_transition 400.0 [get_ports {B[1][2][3]}]
set_max_transition 400.0 [get_ports {B[1][2][2]}]
set_max_transition 400.0 [get_ports {B[1][2][1]}]
set_max_transition 400.0 [get_ports {B[1][2][0]}]
set_max_transition 400.0 [get_ports {B[1][1][7]}]
set_max_transition 400.0 [get_ports {B[1][1][6]}]
set_max_transition 400.0 [get_ports {B[1][1][5]}]
set_max_transition 400.0 [get_ports {B[1][1][4]}]
set_max_transition 400.0 [get_ports {B[1][1][3]}]
set_max_transition 400.0 [get_ports {B[1][1][2]}]
set_max_transition 400.0 [get_ports {B[1][1][1]}]
set_max_transition 400.0 [get_ports {B[1][1][0]}]
set_max_transition 400.0 [get_ports {B[1][0][7]}]
set_max_transition 400.0 [get_ports {B[1][0][6]}]
set_max_transition 400.0 [get_ports {B[1][0][5]}]
set_max_transition 400.0 [get_ports {B[1][0][4]}]
set_max_transition 400.0 [get_ports {B[1][0][3]}]
set_max_transition 400.0 [get_ports {B[1][0][2]}]
set_max_transition 400.0 [get_ports {B[1][0][1]}]
set_max_transition 400.0 [get_ports {B[1][0][0]}]
set_max_transition 400.0 [get_ports {B[0][3][7]}]
set_max_transition 400.0 [get_ports {B[0][3][6]}]
set_max_transition 400.0 [get_ports {B[0][3][5]}]
set_max_transition 400.0 [get_ports {B[0][3][4]}]
set_max_transition 400.0 [get_ports {B[0][3][3]}]
set_max_transition 400.0 [get_ports {B[0][3][2]}]
set_max_transition 400.0 [get_ports {B[0][3][1]}]
set_max_transition 400.0 [get_ports {B[0][3][0]}]
set_max_transition 400.0 [get_ports {B[0][2][7]}]
set_max_transition 400.0 [get_ports {B[0][2][6]}]
set_max_transition 400.0 [get_ports {B[0][2][5]}]
set_max_transition 400.0 [get_ports {B[0][2][4]}]
set_max_transition 400.0 [get_ports {B[0][2][3]}]
set_max_transition 400.0 [get_ports {B[0][2][2]}]
set_max_transition 400.0 [get_ports {B[0][2][1]}]
set_max_transition 400.0 [get_ports {B[0][2][0]}]
set_max_transition 400.0 [get_ports {B[0][1][7]}]
set_max_transition 400.0 [get_ports {B[0][1][6]}]
set_max_transition 400.0 [get_ports {B[0][1][5]}]
set_max_transition 400.0 [get_ports {B[0][1][4]}]
set_max_transition 400.0 [get_ports {B[0][1][3]}]
set_max_transition 400.0 [get_ports {B[0][1][2]}]
set_max_transition 400.0 [get_ports {B[0][1][1]}]
set_max_transition 400.0 [get_ports {B[0][1][0]}]
set_max_transition 400.0 [get_ports {B[0][0][7]}]
set_max_transition 400.0 [get_ports {B[0][0][6]}]
set_max_transition 400.0 [get_ports {B[0][0][5]}]
set_max_transition 400.0 [get_ports {B[0][0][4]}]
set_max_transition 400.0 [get_ports {B[0][0][3]}]
set_max_transition 400.0 [get_ports {B[0][0][2]}]
set_max_transition 400.0 [get_ports {B[0][0][1]}]
set_max_transition 400.0 [get_ports {B[0][0][0]}]
set_max_transition 400.0 [get_ports {C[3][3][15]}]
set_max_transition 400.0 [get_ports {C[3][3][14]}]
set_max_transition 400.0 [get_ports {C[3][3][13]}]
set_max_transition 400.0 [get_ports {C[3][3][12]}]
set_max_transition 400.0 [get_ports {C[3][3][11]}]
set_max_transition 400.0 [get_ports {C[3][3][10]}]
set_max_transition 400.0 [get_ports {C[3][3][9]}]
set_max_transition 400.0 [get_ports {C[3][3][8]}]
set_max_transition 400.0 [get_ports {C[3][3][7]}]
set_max_transition 400.0 [get_ports {C[3][3][6]}]
set_max_transition 400.0 [get_ports {C[3][3][5]}]
set_max_transition 400.0 [get_ports {C[3][3][4]}]
set_max_transition 400.0 [get_ports {C[3][3][3]}]
set_max_transition 400.0 [get_ports {C[3][3][2]}]
set_max_transition 400.0 [get_ports {C[3][3][1]}]
set_max_transition 400.0 [get_ports {C[3][3][0]}]
set_max_transition 400.0 [get_ports {C[3][2][15]}]
set_max_transition 400.0 [get_ports {C[3][2][14]}]
set_max_transition 400.0 [get_ports {C[3][2][13]}]
set_max_transition 400.0 [get_ports {C[3][2][12]}]
set_max_transition 400.0 [get_ports {C[3][2][11]}]
set_max_transition 400.0 [get_ports {C[3][2][10]}]
set_max_transition 400.0 [get_ports {C[3][2][9]}]
set_max_transition 400.0 [get_ports {C[3][2][8]}]
set_max_transition 400.0 [get_ports {C[3][2][7]}]
set_max_transition 400.0 [get_ports {C[3][2][6]}]
set_max_transition 400.0 [get_ports {C[3][2][5]}]
set_max_transition 400.0 [get_ports {C[3][2][4]}]
set_max_transition 400.0 [get_ports {C[3][2][3]}]
set_max_transition 400.0 [get_ports {C[3][2][2]}]
set_max_transition 400.0 [get_ports {C[3][2][1]}]
set_max_transition 400.0 [get_ports {C[3][2][0]}]
set_max_transition 400.0 [get_ports {C[3][1][15]}]
set_max_transition 400.0 [get_ports {C[3][1][14]}]
set_max_transition 400.0 [get_ports {C[3][1][13]}]
set_max_transition 400.0 [get_ports {C[3][1][12]}]
set_max_transition 400.0 [get_ports {C[3][1][11]}]
set_max_transition 400.0 [get_ports {C[3][1][10]}]
set_max_transition 400.0 [get_ports {C[3][1][9]}]
set_max_transition 400.0 [get_ports {C[3][1][8]}]
set_max_transition 400.0 [get_ports {C[3][1][7]}]
set_max_transition 400.0 [get_ports {C[3][1][6]}]
set_max_transition 400.0 [get_ports {C[3][1][5]}]
set_max_transition 400.0 [get_ports {C[3][1][4]}]
set_max_transition 400.0 [get_ports {C[3][1][3]}]
set_max_transition 400.0 [get_ports {C[3][1][2]}]
set_max_transition 400.0 [get_ports {C[3][1][1]}]
set_max_transition 400.0 [get_ports {C[3][1][0]}]
set_max_transition 400.0 [get_ports {C[3][0][15]}]
set_max_transition 400.0 [get_ports {C[3][0][14]}]
set_max_transition 400.0 [get_ports {C[3][0][13]}]
set_max_transition 400.0 [get_ports {C[3][0][12]}]
set_max_transition 400.0 [get_ports {C[3][0][11]}]
set_max_transition 400.0 [get_ports {C[3][0][10]}]
set_max_transition 400.0 [get_ports {C[3][0][9]}]
set_max_transition 400.0 [get_ports {C[3][0][8]}]
set_max_transition 400.0 [get_ports {C[3][0][7]}]
set_max_transition 400.0 [get_ports {C[3][0][6]}]
set_max_transition 400.0 [get_ports {C[3][0][5]}]
set_max_transition 400.0 [get_ports {C[3][0][4]}]
set_max_transition 400.0 [get_ports {C[3][0][3]}]
set_max_transition 400.0 [get_ports {C[3][0][2]}]
set_max_transition 400.0 [get_ports {C[3][0][1]}]
set_max_transition 400.0 [get_ports {C[3][0][0]}]
set_max_transition 400.0 [get_ports {C[2][3][15]}]
set_max_transition 400.0 [get_ports {C[2][3][14]}]
set_max_transition 400.0 [get_ports {C[2][3][13]}]
set_max_transition 400.0 [get_ports {C[2][3][12]}]
set_max_transition 400.0 [get_ports {C[2][3][11]}]
set_max_transition 400.0 [get_ports {C[2][3][10]}]
set_max_transition 400.0 [get_ports {C[2][3][9]}]
set_max_transition 400.0 [get_ports {C[2][3][8]}]
set_max_transition 400.0 [get_ports {C[2][3][7]}]
set_max_transition 400.0 [get_ports {C[2][3][6]}]
set_max_transition 400.0 [get_ports {C[2][3][5]}]
set_max_transition 400.0 [get_ports {C[2][3][4]}]
set_max_transition 400.0 [get_ports {C[2][3][3]}]
set_max_transition 400.0 [get_ports {C[2][3][2]}]
set_max_transition 400.0 [get_ports {C[2][3][1]}]
set_max_transition 400.0 [get_ports {C[2][3][0]}]
set_max_transition 400.0 [get_ports {C[2][2][15]}]
set_max_transition 400.0 [get_ports {C[2][2][14]}]
set_max_transition 400.0 [get_ports {C[2][2][13]}]
set_max_transition 400.0 [get_ports {C[2][2][12]}]
set_max_transition 400.0 [get_ports {C[2][2][11]}]
set_max_transition 400.0 [get_ports {C[2][2][10]}]
set_max_transition 400.0 [get_ports {C[2][2][9]}]
set_max_transition 400.0 [get_ports {C[2][2][8]}]
set_max_transition 400.0 [get_ports {C[2][2][7]}]
set_max_transition 400.0 [get_ports {C[2][2][6]}]
set_max_transition 400.0 [get_ports {C[2][2][5]}]
set_max_transition 400.0 [get_ports {C[2][2][4]}]
set_max_transition 400.0 [get_ports {C[2][2][3]}]
set_max_transition 400.0 [get_ports {C[2][2][2]}]
set_max_transition 400.0 [get_ports {C[2][2][1]}]
set_max_transition 400.0 [get_ports {C[2][2][0]}]
set_max_transition 400.0 [get_ports {C[2][1][15]}]
set_max_transition 400.0 [get_ports {C[2][1][14]}]
set_max_transition 400.0 [get_ports {C[2][1][13]}]
set_max_transition 400.0 [get_ports {C[2][1][12]}]
set_max_transition 400.0 [get_ports {C[2][1][11]}]
set_max_transition 400.0 [get_ports {C[2][1][10]}]
set_max_transition 400.0 [get_ports {C[2][1][9]}]
set_max_transition 400.0 [get_ports {C[2][1][8]}]
set_max_transition 400.0 [get_ports {C[2][1][7]}]
set_max_transition 400.0 [get_ports {C[2][1][6]}]
set_max_transition 400.0 [get_ports {C[2][1][5]}]
set_max_transition 400.0 [get_ports {C[2][1][4]}]
set_max_transition 400.0 [get_ports {C[2][1][3]}]
set_max_transition 400.0 [get_ports {C[2][1][2]}]
set_max_transition 400.0 [get_ports {C[2][1][1]}]
set_max_transition 400.0 [get_ports {C[2][1][0]}]
set_max_transition 400.0 [get_ports {C[2][0][15]}]
set_max_transition 400.0 [get_ports {C[2][0][14]}]
set_max_transition 400.0 [get_ports {C[2][0][13]}]
set_max_transition 400.0 [get_ports {C[2][0][12]}]
set_max_transition 400.0 [get_ports {C[2][0][11]}]
set_max_transition 400.0 [get_ports {C[2][0][10]}]
set_max_transition 400.0 [get_ports {C[2][0][9]}]
set_max_transition 400.0 [get_ports {C[2][0][8]}]
set_max_transition 400.0 [get_ports {C[2][0][7]}]
set_max_transition 400.0 [get_ports {C[2][0][6]}]
set_max_transition 400.0 [get_ports {C[2][0][5]}]
set_max_transition 400.0 [get_ports {C[2][0][4]}]
set_max_transition 400.0 [get_ports {C[2][0][3]}]
set_max_transition 400.0 [get_ports {C[2][0][2]}]
set_max_transition 400.0 [get_ports {C[2][0][1]}]
set_max_transition 400.0 [get_ports {C[2][0][0]}]
set_max_transition 400.0 [get_ports {C[1][3][15]}]
set_max_transition 400.0 [get_ports {C[1][3][14]}]
set_max_transition 400.0 [get_ports {C[1][3][13]}]
set_max_transition 400.0 [get_ports {C[1][3][12]}]
set_max_transition 400.0 [get_ports {C[1][3][11]}]
set_max_transition 400.0 [get_ports {C[1][3][10]}]
set_max_transition 400.0 [get_ports {C[1][3][9]}]
set_max_transition 400.0 [get_ports {C[1][3][8]}]
set_max_transition 400.0 [get_ports {C[1][3][7]}]
set_max_transition 400.0 [get_ports {C[1][3][6]}]
set_max_transition 400.0 [get_ports {C[1][3][5]}]
set_max_transition 400.0 [get_ports {C[1][3][4]}]
set_max_transition 400.0 [get_ports {C[1][3][3]}]
set_max_transition 400.0 [get_ports {C[1][3][2]}]
set_max_transition 400.0 [get_ports {C[1][3][1]}]
set_max_transition 400.0 [get_ports {C[1][3][0]}]
set_max_transition 400.0 [get_ports {C[1][2][15]}]
set_max_transition 400.0 [get_ports {C[1][2][14]}]
set_max_transition 400.0 [get_ports {C[1][2][13]}]
set_max_transition 400.0 [get_ports {C[1][2][12]}]
set_max_transition 400.0 [get_ports {C[1][2][11]}]
set_max_transition 400.0 [get_ports {C[1][2][10]}]
set_max_transition 400.0 [get_ports {C[1][2][9]}]
set_max_transition 400.0 [get_ports {C[1][2][8]}]
set_max_transition 400.0 [get_ports {C[1][2][7]}]
set_max_transition 400.0 [get_ports {C[1][2][6]}]
set_max_transition 400.0 [get_ports {C[1][2][5]}]
set_max_transition 400.0 [get_ports {C[1][2][4]}]
set_max_transition 400.0 [get_ports {C[1][2][3]}]
set_max_transition 400.0 [get_ports {C[1][2][2]}]
set_max_transition 400.0 [get_ports {C[1][2][1]}]
set_max_transition 400.0 [get_ports {C[1][2][0]}]
set_max_transition 400.0 [get_ports {C[1][1][15]}]
set_max_transition 400.0 [get_ports {C[1][1][14]}]
set_max_transition 400.0 [get_ports {C[1][1][13]}]
set_max_transition 400.0 [get_ports {C[1][1][12]}]
set_max_transition 400.0 [get_ports {C[1][1][11]}]
set_max_transition 400.0 [get_ports {C[1][1][10]}]
set_max_transition 400.0 [get_ports {C[1][1][9]}]
set_max_transition 400.0 [get_ports {C[1][1][8]}]
set_max_transition 400.0 [get_ports {C[1][1][7]}]
set_max_transition 400.0 [get_ports {C[1][1][6]}]
set_max_transition 400.0 [get_ports {C[1][1][5]}]
set_max_transition 400.0 [get_ports {C[1][1][4]}]
set_max_transition 400.0 [get_ports {C[1][1][3]}]
set_max_transition 400.0 [get_ports {C[1][1][2]}]
set_max_transition 400.0 [get_ports {C[1][1][1]}]
set_max_transition 400.0 [get_ports {C[1][1][0]}]
set_max_transition 400.0 [get_ports {C[1][0][15]}]
set_max_transition 400.0 [get_ports {C[1][0][14]}]
set_max_transition 400.0 [get_ports {C[1][0][13]}]
set_max_transition 400.0 [get_ports {C[1][0][12]}]
set_max_transition 400.0 [get_ports {C[1][0][11]}]
set_max_transition 400.0 [get_ports {C[1][0][10]}]
set_max_transition 400.0 [get_ports {C[1][0][9]}]
set_max_transition 400.0 [get_ports {C[1][0][8]}]
set_max_transition 400.0 [get_ports {C[1][0][7]}]
set_max_transition 400.0 [get_ports {C[1][0][6]}]
set_max_transition 400.0 [get_ports {C[1][0][5]}]
set_max_transition 400.0 [get_ports {C[1][0][4]}]
set_max_transition 400.0 [get_ports {C[1][0][3]}]
set_max_transition 400.0 [get_ports {C[1][0][2]}]
set_max_transition 400.0 [get_ports {C[1][0][1]}]
set_max_transition 400.0 [get_ports {C[1][0][0]}]
set_max_transition 400.0 [get_ports {C[0][3][15]}]
set_max_transition 400.0 [get_ports {C[0][3][14]}]
set_max_transition 400.0 [get_ports {C[0][3][13]}]
set_max_transition 400.0 [get_ports {C[0][3][12]}]
set_max_transition 400.0 [get_ports {C[0][3][11]}]
set_max_transition 400.0 [get_ports {C[0][3][10]}]
set_max_transition 400.0 [get_ports {C[0][3][9]}]
set_max_transition 400.0 [get_ports {C[0][3][8]}]
set_max_transition 400.0 [get_ports {C[0][3][7]}]
set_max_transition 400.0 [get_ports {C[0][3][6]}]
set_max_transition 400.0 [get_ports {C[0][3][5]}]
set_max_transition 400.0 [get_ports {C[0][3][4]}]
set_max_transition 400.0 [get_ports {C[0][3][3]}]
set_max_transition 400.0 [get_ports {C[0][3][2]}]
set_max_transition 400.0 [get_ports {C[0][3][1]}]
set_max_transition 400.0 [get_ports {C[0][3][0]}]
set_max_transition 400.0 [get_ports {C[0][2][15]}]
set_max_transition 400.0 [get_ports {C[0][2][14]}]
set_max_transition 400.0 [get_ports {C[0][2][13]}]
set_max_transition 400.0 [get_ports {C[0][2][12]}]
set_max_transition 400.0 [get_ports {C[0][2][11]}]
set_max_transition 400.0 [get_ports {C[0][2][10]}]
set_max_transition 400.0 [get_ports {C[0][2][9]}]
set_max_transition 400.0 [get_ports {C[0][2][8]}]
set_max_transition 400.0 [get_ports {C[0][2][7]}]
set_max_transition 400.0 [get_ports {C[0][2][6]}]
set_max_transition 400.0 [get_ports {C[0][2][5]}]
set_max_transition 400.0 [get_ports {C[0][2][4]}]
set_max_transition 400.0 [get_ports {C[0][2][3]}]
set_max_transition 400.0 [get_ports {C[0][2][2]}]
set_max_transition 400.0 [get_ports {C[0][2][1]}]
set_max_transition 400.0 [get_ports {C[0][2][0]}]
set_max_transition 400.0 [get_ports {C[0][1][15]}]
set_max_transition 400.0 [get_ports {C[0][1][14]}]
set_max_transition 400.0 [get_ports {C[0][1][13]}]
set_max_transition 400.0 [get_ports {C[0][1][12]}]
set_max_transition 400.0 [get_ports {C[0][1][11]}]
set_max_transition 400.0 [get_ports {C[0][1][10]}]
set_max_transition 400.0 [get_ports {C[0][1][9]}]
set_max_transition 400.0 [get_ports {C[0][1][8]}]
set_max_transition 400.0 [get_ports {C[0][1][7]}]
set_max_transition 400.0 [get_ports {C[0][1][6]}]
set_max_transition 400.0 [get_ports {C[0][1][5]}]
set_max_transition 400.0 [get_ports {C[0][1][4]}]
set_max_transition 400.0 [get_ports {C[0][1][3]}]
set_max_transition 400.0 [get_ports {C[0][1][2]}]
set_max_transition 400.0 [get_ports {C[0][1][1]}]
set_max_transition 400.0 [get_ports {C[0][1][0]}]
set_max_transition 400.0 [get_ports {C[0][0][15]}]
set_max_transition 400.0 [get_ports {C[0][0][14]}]
set_max_transition 400.0 [get_ports {C[0][0][13]}]
set_max_transition 400.0 [get_ports {C[0][0][12]}]
set_max_transition 400.0 [get_ports {C[0][0][11]}]
set_max_transition 400.0 [get_ports {C[0][0][10]}]
set_max_transition 400.0 [get_ports {C[0][0][9]}]
set_max_transition 400.0 [get_ports {C[0][0][8]}]
set_max_transition 400.0 [get_ports {C[0][0][7]}]
set_max_transition 400.0 [get_ports {C[0][0][6]}]
set_max_transition 400.0 [get_ports {C[0][0][5]}]
set_max_transition 400.0 [get_ports {C[0][0][4]}]
set_max_transition 400.0 [get_ports {C[0][0][3]}]
set_max_transition 400.0 [get_ports {C[0][0][2]}]
set_max_transition 400.0 [get_ports {C[0][0][1]}]
set_max_transition 400.0 [get_ports {C[0][0][0]}]
set_max_transition 400.0 [get_ports done]
set_input_transition 1000.0 [get_ports clk]
set_input_transition 1000.0 [get_ports reset]
set_input_transition 1000.0 [get_ports start]
set_input_transition 1000.0 [get_ports {A[3][3][7]}]
set_input_transition 1000.0 [get_ports {A[3][3][6]}]
set_input_transition 1000.0 [get_ports {A[3][3][5]}]
set_input_transition 1000.0 [get_ports {A[3][3][4]}]
set_input_transition 1000.0 [get_ports {A[3][3][3]}]
set_input_transition 1000.0 [get_ports {A[3][3][2]}]
set_input_transition 1000.0 [get_ports {A[3][3][1]}]
set_input_transition 1000.0 [get_ports {A[3][3][0]}]
set_input_transition 1000.0 [get_ports {A[3][2][7]}]
set_input_transition 1000.0 [get_ports {A[3][2][6]}]
set_input_transition 1000.0 [get_ports {A[3][2][5]}]
set_input_transition 1000.0 [get_ports {A[3][2][4]}]
set_input_transition 1000.0 [get_ports {A[3][2][3]}]
set_input_transition 1000.0 [get_ports {A[3][2][2]}]
set_input_transition 1000.0 [get_ports {A[3][2][1]}]
set_input_transition 1000.0 [get_ports {A[3][2][0]}]
set_input_transition 1000.0 [get_ports {A[3][1][7]}]
set_input_transition 1000.0 [get_ports {A[3][1][6]}]
set_input_transition 1000.0 [get_ports {A[3][1][5]}]
set_input_transition 1000.0 [get_ports {A[3][1][4]}]
set_input_transition 1000.0 [get_ports {A[3][1][3]}]
set_input_transition 1000.0 [get_ports {A[3][1][2]}]
set_input_transition 1000.0 [get_ports {A[3][1][1]}]
set_input_transition 1000.0 [get_ports {A[3][1][0]}]
set_input_transition 1000.0 [get_ports {A[3][0][7]}]
set_input_transition 1000.0 [get_ports {A[3][0][6]}]
set_input_transition 1000.0 [get_ports {A[3][0][5]}]
set_input_transition 1000.0 [get_ports {A[3][0][4]}]
set_input_transition 1000.0 [get_ports {A[3][0][3]}]
set_input_transition 1000.0 [get_ports {A[3][0][2]}]
set_input_transition 1000.0 [get_ports {A[3][0][1]}]
set_input_transition 1000.0 [get_ports {A[3][0][0]}]
set_input_transition 1000.0 [get_ports {A[2][3][7]}]
set_input_transition 1000.0 [get_ports {A[2][3][6]}]
set_input_transition 1000.0 [get_ports {A[2][3][5]}]
set_input_transition 1000.0 [get_ports {A[2][3][4]}]
set_input_transition 1000.0 [get_ports {A[2][3][3]}]
set_input_transition 1000.0 [get_ports {A[2][3][2]}]
set_input_transition 1000.0 [get_ports {A[2][3][1]}]
set_input_transition 1000.0 [get_ports {A[2][3][0]}]
set_input_transition 1000.0 [get_ports {A[2][2][7]}]
set_input_transition 1000.0 [get_ports {A[2][2][6]}]
set_input_transition 1000.0 [get_ports {A[2][2][5]}]
set_input_transition 1000.0 [get_ports {A[2][2][4]}]
set_input_transition 1000.0 [get_ports {A[2][2][3]}]
set_input_transition 1000.0 [get_ports {A[2][2][2]}]
set_input_transition 1000.0 [get_ports {A[2][2][1]}]
set_input_transition 1000.0 [get_ports {A[2][2][0]}]
set_input_transition 1000.0 [get_ports {A[2][1][7]}]
set_input_transition 1000.0 [get_ports {A[2][1][6]}]
set_input_transition 1000.0 [get_ports {A[2][1][5]}]
set_input_transition 1000.0 [get_ports {A[2][1][4]}]
set_input_transition 1000.0 [get_ports {A[2][1][3]}]
set_input_transition 1000.0 [get_ports {A[2][1][2]}]
set_input_transition 1000.0 [get_ports {A[2][1][1]}]
set_input_transition 1000.0 [get_ports {A[2][1][0]}]
set_input_transition 1000.0 [get_ports {A[2][0][7]}]
set_input_transition 1000.0 [get_ports {A[2][0][6]}]
set_input_transition 1000.0 [get_ports {A[2][0][5]}]
set_input_transition 1000.0 [get_ports {A[2][0][4]}]
set_input_transition 1000.0 [get_ports {A[2][0][3]}]
set_input_transition 1000.0 [get_ports {A[2][0][2]}]
set_input_transition 1000.0 [get_ports {A[2][0][1]}]
set_input_transition 1000.0 [get_ports {A[2][0][0]}]
set_input_transition 1000.0 [get_ports {A[1][3][7]}]
set_input_transition 1000.0 [get_ports {A[1][3][6]}]
set_input_transition 1000.0 [get_ports {A[1][3][5]}]
set_input_transition 1000.0 [get_ports {A[1][3][4]}]
set_input_transition 1000.0 [get_ports {A[1][3][3]}]
set_input_transition 1000.0 [get_ports {A[1][3][2]}]
set_input_transition 1000.0 [get_ports {A[1][3][1]}]
set_input_transition 1000.0 [get_ports {A[1][3][0]}]
set_input_transition 1000.0 [get_ports {A[1][2][7]}]
set_input_transition 1000.0 [get_ports {A[1][2][6]}]
set_input_transition 1000.0 [get_ports {A[1][2][5]}]
set_input_transition 1000.0 [get_ports {A[1][2][4]}]
set_input_transition 1000.0 [get_ports {A[1][2][3]}]
set_input_transition 1000.0 [get_ports {A[1][2][2]}]
set_input_transition 1000.0 [get_ports {A[1][2][1]}]
set_input_transition 1000.0 [get_ports {A[1][2][0]}]
set_input_transition 1000.0 [get_ports {A[1][1][7]}]
set_input_transition 1000.0 [get_ports {A[1][1][6]}]
set_input_transition 1000.0 [get_ports {A[1][1][5]}]
set_input_transition 1000.0 [get_ports {A[1][1][4]}]
set_input_transition 1000.0 [get_ports {A[1][1][3]}]
set_input_transition 1000.0 [get_ports {A[1][1][2]}]
set_input_transition 1000.0 [get_ports {A[1][1][1]}]
set_input_transition 1000.0 [get_ports {A[1][1][0]}]
set_input_transition 1000.0 [get_ports {A[1][0][7]}]
set_input_transition 1000.0 [get_ports {A[1][0][6]}]
set_input_transition 1000.0 [get_ports {A[1][0][5]}]
set_input_transition 1000.0 [get_ports {A[1][0][4]}]
set_input_transition 1000.0 [get_ports {A[1][0][3]}]
set_input_transition 1000.0 [get_ports {A[1][0][2]}]
set_input_transition 1000.0 [get_ports {A[1][0][1]}]
set_input_transition 1000.0 [get_ports {A[1][0][0]}]
set_input_transition 1000.0 [get_ports {A[0][3][7]}]
set_input_transition 1000.0 [get_ports {A[0][3][6]}]
set_input_transition 1000.0 [get_ports {A[0][3][5]}]
set_input_transition 1000.0 [get_ports {A[0][3][4]}]
set_input_transition 1000.0 [get_ports {A[0][3][3]}]
set_input_transition 1000.0 [get_ports {A[0][3][2]}]
set_input_transition 1000.0 [get_ports {A[0][3][1]}]
set_input_transition 1000.0 [get_ports {A[0][3][0]}]
set_input_transition 1000.0 [get_ports {A[0][2][7]}]
set_input_transition 1000.0 [get_ports {A[0][2][6]}]
set_input_transition 1000.0 [get_ports {A[0][2][5]}]
set_input_transition 1000.0 [get_ports {A[0][2][4]}]
set_input_transition 1000.0 [get_ports {A[0][2][3]}]
set_input_transition 1000.0 [get_ports {A[0][2][2]}]
set_input_transition 1000.0 [get_ports {A[0][2][1]}]
set_input_transition 1000.0 [get_ports {A[0][2][0]}]
set_input_transition 1000.0 [get_ports {A[0][1][7]}]
set_input_transition 1000.0 [get_ports {A[0][1][6]}]
set_input_transition 1000.0 [get_ports {A[0][1][5]}]
set_input_transition 1000.0 [get_ports {A[0][1][4]}]
set_input_transition 1000.0 [get_ports {A[0][1][3]}]
set_input_transition 1000.0 [get_ports {A[0][1][2]}]
set_input_transition 1000.0 [get_ports {A[0][1][1]}]
set_input_transition 1000.0 [get_ports {A[0][1][0]}]
set_input_transition 1000.0 [get_ports {A[0][0][7]}]
set_input_transition 1000.0 [get_ports {A[0][0][6]}]
set_input_transition 1000.0 [get_ports {A[0][0][5]}]
set_input_transition 1000.0 [get_ports {A[0][0][4]}]
set_input_transition 1000.0 [get_ports {A[0][0][3]}]
set_input_transition 1000.0 [get_ports {A[0][0][2]}]
set_input_transition 1000.0 [get_ports {A[0][0][1]}]
set_input_transition 1000.0 [get_ports {A[0][0][0]}]
set_input_transition 1000.0 [get_ports {B[3][3][7]}]
set_input_transition 1000.0 [get_ports {B[3][3][6]}]
set_input_transition 1000.0 [get_ports {B[3][3][5]}]
set_input_transition 1000.0 [get_ports {B[3][3][4]}]
set_input_transition 1000.0 [get_ports {B[3][3][3]}]
set_input_transition 1000.0 [get_ports {B[3][3][2]}]
set_input_transition 1000.0 [get_ports {B[3][3][1]}]
set_input_transition 1000.0 [get_ports {B[3][3][0]}]
set_input_transition 1000.0 [get_ports {B[3][2][7]}]
set_input_transition 1000.0 [get_ports {B[3][2][6]}]
set_input_transition 1000.0 [get_ports {B[3][2][5]}]
set_input_transition 1000.0 [get_ports {B[3][2][4]}]
set_input_transition 1000.0 [get_ports {B[3][2][3]}]
set_input_transition 1000.0 [get_ports {B[3][2][2]}]
set_input_transition 1000.0 [get_ports {B[3][2][1]}]
set_input_transition 1000.0 [get_ports {B[3][2][0]}]
set_input_transition 1000.0 [get_ports {B[3][1][7]}]
set_input_transition 1000.0 [get_ports {B[3][1][6]}]
set_input_transition 1000.0 [get_ports {B[3][1][5]}]
set_input_transition 1000.0 [get_ports {B[3][1][4]}]
set_input_transition 1000.0 [get_ports {B[3][1][3]}]
set_input_transition 1000.0 [get_ports {B[3][1][2]}]
set_input_transition 1000.0 [get_ports {B[3][1][1]}]
set_input_transition 1000.0 [get_ports {B[3][1][0]}]
set_input_transition 1000.0 [get_ports {B[3][0][7]}]
set_input_transition 1000.0 [get_ports {B[3][0][6]}]
set_input_transition 1000.0 [get_ports {B[3][0][5]}]
set_input_transition 1000.0 [get_ports {B[3][0][4]}]
set_input_transition 1000.0 [get_ports {B[3][0][3]}]
set_input_transition 1000.0 [get_ports {B[3][0][2]}]
set_input_transition 1000.0 [get_ports {B[3][0][1]}]
set_input_transition 1000.0 [get_ports {B[3][0][0]}]
set_input_transition 1000.0 [get_ports {B[2][3][7]}]
set_input_transition 1000.0 [get_ports {B[2][3][6]}]
set_input_transition 1000.0 [get_ports {B[2][3][5]}]
set_input_transition 1000.0 [get_ports {B[2][3][4]}]
set_input_transition 1000.0 [get_ports {B[2][3][3]}]
set_input_transition 1000.0 [get_ports {B[2][3][2]}]
set_input_transition 1000.0 [get_ports {B[2][3][1]}]
set_input_transition 1000.0 [get_ports {B[2][3][0]}]
set_input_transition 1000.0 [get_ports {B[2][2][7]}]
set_input_transition 1000.0 [get_ports {B[2][2][6]}]
set_input_transition 1000.0 [get_ports {B[2][2][5]}]
set_input_transition 1000.0 [get_ports {B[2][2][4]}]
set_input_transition 1000.0 [get_ports {B[2][2][3]}]
set_input_transition 1000.0 [get_ports {B[2][2][2]}]
set_input_transition 1000.0 [get_ports {B[2][2][1]}]
set_input_transition 1000.0 [get_ports {B[2][2][0]}]
set_input_transition 1000.0 [get_ports {B[2][1][7]}]
set_input_transition 1000.0 [get_ports {B[2][1][6]}]
set_input_transition 1000.0 [get_ports {B[2][1][5]}]
set_input_transition 1000.0 [get_ports {B[2][1][4]}]
set_input_transition 1000.0 [get_ports {B[2][1][3]}]
set_input_transition 1000.0 [get_ports {B[2][1][2]}]
set_input_transition 1000.0 [get_ports {B[2][1][1]}]
set_input_transition 1000.0 [get_ports {B[2][1][0]}]
set_input_transition 1000.0 [get_ports {B[2][0][7]}]
set_input_transition 1000.0 [get_ports {B[2][0][6]}]
set_input_transition 1000.0 [get_ports {B[2][0][5]}]
set_input_transition 1000.0 [get_ports {B[2][0][4]}]
set_input_transition 1000.0 [get_ports {B[2][0][3]}]
set_input_transition 1000.0 [get_ports {B[2][0][2]}]
set_input_transition 1000.0 [get_ports {B[2][0][1]}]
set_input_transition 1000.0 [get_ports {B[2][0][0]}]
set_input_transition 1000.0 [get_ports {B[1][3][7]}]
set_input_transition 1000.0 [get_ports {B[1][3][6]}]
set_input_transition 1000.0 [get_ports {B[1][3][5]}]
set_input_transition 1000.0 [get_ports {B[1][3][4]}]
set_input_transition 1000.0 [get_ports {B[1][3][3]}]
set_input_transition 1000.0 [get_ports {B[1][3][2]}]
set_input_transition 1000.0 [get_ports {B[1][3][1]}]
set_input_transition 1000.0 [get_ports {B[1][3][0]}]
set_input_transition 1000.0 [get_ports {B[1][2][7]}]
set_input_transition 1000.0 [get_ports {B[1][2][6]}]
set_input_transition 1000.0 [get_ports {B[1][2][5]}]
set_input_transition 1000.0 [get_ports {B[1][2][4]}]
set_input_transition 1000.0 [get_ports {B[1][2][3]}]
set_input_transition 1000.0 [get_ports {B[1][2][2]}]
set_input_transition 1000.0 [get_ports {B[1][2][1]}]
set_input_transition 1000.0 [get_ports {B[1][2][0]}]
set_input_transition 1000.0 [get_ports {B[1][1][7]}]
set_input_transition 1000.0 [get_ports {B[1][1][6]}]
set_input_transition 1000.0 [get_ports {B[1][1][5]}]
set_input_transition 1000.0 [get_ports {B[1][1][4]}]
set_input_transition 1000.0 [get_ports {B[1][1][3]}]
set_input_transition 1000.0 [get_ports {B[1][1][2]}]
set_input_transition 1000.0 [get_ports {B[1][1][1]}]
set_input_transition 1000.0 [get_ports {B[1][1][0]}]
set_input_transition 1000.0 [get_ports {B[1][0][7]}]
set_input_transition 1000.0 [get_ports {B[1][0][6]}]
set_input_transition 1000.0 [get_ports {B[1][0][5]}]
set_input_transition 1000.0 [get_ports {B[1][0][4]}]
set_input_transition 1000.0 [get_ports {B[1][0][3]}]
set_input_transition 1000.0 [get_ports {B[1][0][2]}]
set_input_transition 1000.0 [get_ports {B[1][0][1]}]
set_input_transition 1000.0 [get_ports {B[1][0][0]}]
set_input_transition 1000.0 [get_ports {B[0][3][7]}]
set_input_transition 1000.0 [get_ports {B[0][3][6]}]
set_input_transition 1000.0 [get_ports {B[0][3][5]}]
set_input_transition 1000.0 [get_ports {B[0][3][4]}]
set_input_transition 1000.0 [get_ports {B[0][3][3]}]
set_input_transition 1000.0 [get_ports {B[0][3][2]}]
set_input_transition 1000.0 [get_ports {B[0][3][1]}]
set_input_transition 1000.0 [get_ports {B[0][3][0]}]
set_input_transition 1000.0 [get_ports {B[0][2][7]}]
set_input_transition 1000.0 [get_ports {B[0][2][6]}]
set_input_transition 1000.0 [get_ports {B[0][2][5]}]
set_input_transition 1000.0 [get_ports {B[0][2][4]}]
set_input_transition 1000.0 [get_ports {B[0][2][3]}]
set_input_transition 1000.0 [get_ports {B[0][2][2]}]
set_input_transition 1000.0 [get_ports {B[0][2][1]}]
set_input_transition 1000.0 [get_ports {B[0][2][0]}]
set_input_transition 1000.0 [get_ports {B[0][1][7]}]
set_input_transition 1000.0 [get_ports {B[0][1][6]}]
set_input_transition 1000.0 [get_ports {B[0][1][5]}]
set_input_transition 1000.0 [get_ports {B[0][1][4]}]
set_input_transition 1000.0 [get_ports {B[0][1][3]}]
set_input_transition 1000.0 [get_ports {B[0][1][2]}]
set_input_transition 1000.0 [get_ports {B[0][1][1]}]
set_input_transition 1000.0 [get_ports {B[0][1][0]}]
set_input_transition 1000.0 [get_ports {B[0][0][7]}]
set_input_transition 1000.0 [get_ports {B[0][0][6]}]
set_input_transition 1000.0 [get_ports {B[0][0][5]}]
set_input_transition 1000.0 [get_ports {B[0][0][4]}]
set_input_transition 1000.0 [get_ports {B[0][0][3]}]
set_input_transition 1000.0 [get_ports {B[0][0][2]}]
set_input_transition 1000.0 [get_ports {B[0][0][1]}]
set_input_transition 1000.0 [get_ports {B[0][0][0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 50.0 [get_clocks clk]
set_clock_uncertainty -hold 50.0 [get_clocks clk]
